## Q.1 Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [ ]:
import pandas as pd
list = [4,8,15,16,23,42]

In [5]:
df = pd.Series(list)

In [6]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
type(df)

pandas.core.series.Series

In [8]:
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q.2 Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [10]:
a = [1,2,3,4,5,6,7,8,9,10]
my_series = pd.Series(a)
print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Q.3 Create a Pandas DataFrame that contains the following data:

In [11]:
dict1 = {
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

In [12]:
df = pd.DataFrame(dict1)

In [13]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [15]:
df.set_index("Name")

        Age  Gender
Name
Alice    25  Female
Bob      30    Male
Claire   27  Female

## Q.4 What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a tabular spreadsheet like structure rows each of which containing one or more columns while Series is a one dimensional array with indexes, it storea single column or row of data in DataFrame.

In [16]:
dict1 = {
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

In [17]:
df = pd.DataFrame(dict1)

In [18]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [19]:
ages = pd.Series([25,30,27],name='Age')

In [20]:
print(ages)

0    25
1    30
2    27
Name: Age, dtype: int64

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [21]:
dict1 = {
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}

In [22]:
df = pd.DataFrame(dict1)

In [23]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [24]:
df.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [25]:
df.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [26]:
df.count()

Name      3
Age       3
Gender    3
dtype: int64

In [29]:
df.dropna()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All are mutable

## Q.7 Create a DataFrame using multiple Series. Explain with an example.

In [30]:
import pandas as pd

# Creating the first Series
s1 = pd.Series([1, 2, 3, 4], name='A')

# Creating the second Series
s2 = pd.Series(['a', 'b', 'c', 'd'], name='B')

# Creating the third Series
s3 = pd.Series([0.1, 0.2, 0.3, 0.4], name='C')

# Concatenating the three Series into a single DataFrame
df = pd.concat([s1, s2, s3], axis=1)

# Printing the resulting DataFrame
print(df)

   A  B    C
0  1  a  0.1
1  2  b  0.2
2  3  c  0.3
3  4  d  0.4